package Registration;

public class idias {
    // добавляем ник


    //методы для пользователя
    //пост, сторист(создать, поделиться, добавить #, отметка др друзей,поделиться, удалить(шрифры, маски, как в камере увелил.уменьшить,свободные руки)
    // пост могут лайкнуть (картма) и дизлайкнуть, пост можно удалить, но карма не изменится
    // друзья поиск по нику, по фио, интеграция с тел.книжкой, пригласить в приложение,
    // лента общая куча (по интересам в будущем)
    //лента моих друзей
    //отправить сбщ- всем , если друг- то сразу же, если нет то то чез запрос
    //посмотреть кто карму поставил(лайки), комменты. без грейда?
    // палки, 10 кругов, увеличение в 1-2 раза, 1-3 раза, 1-10 рез. палка засекречена, передача друзьям, или подписчикам, тому чье видео понравилось
    /*
    палка и еет срок дейсткия, 1 месяц, если она не востребована, то она передается случайному пользователю. тот кто передал видит кому передалась
    через 10 кругов палка сгарает,
     */
    /*
    дабавить доброе дело(кто нуждается), верификация
    взять доброе дело из кучи(животные, лечение, нуждающиеся, экология, дети, пенсионеры, реабилитация, с
cтартап, другое, волонтерство, культурно просветительская, спорт, образовательная,
    жилищные, работа, санитарно эпидемиологические, пострадавшим от стехийных бедствий, инвалиды, культурно просветительская)

    регистрация доброго дела происходит через отдельную вкладку,
     */
    /*
    сторис
    раздел подучил добро, сделал добро
     */
    /*

     */
}
